//=========================================================================================================================
//
// 背景 [BG.h]
// Author:Hiroya Katano
//
//=========================================================================================================================
#ifndef _BG_H_
#define _BG_H_
#include "main.h"

//=========================================================================================================================
// マクロ定義
//=========================================================================================================================
#define FIRST_BG_POS_LEFT_X (SCREEN_WIDTH_L)
#define FIRST_BG_POS_RIGHT_X (2560 * 2)
#define SECOND_BG_POS_LEFT_X (SCREEN_WIDTH_L)
#define SECOND_BG_POS_RIGHT_X (1960)
#define BG_POS_TOP_Y (SCREEN_HEIGHT_T)
#define BG_POS_UNDER_Y (SCREEN_HEIGHT_U)
#define BG_COLOR_R (255)														// 背景色(赤)
#define BG_COLOR_G (255)														// 背景色(緑)
#define BG_COLOR_B (255)														// 背景色(青)
#define BG_COLOR_A (255)														// 背景色(透明度)
#define MAX_BG_TYPE (2)
#define MOVE_FIRST_BG_U (0.0001f)

//=========================================================================================================================
// プロトタイプ宣言
//=========================================================================================================================
HRESULT InitBG(void);															// ポリゴンの初期化処理
void UninitBG(void);															// ポリゴンの終了処理
void UpdateBG(void);															// ポリゴンの更新処理
void DrawBG(void);																// ポリゴンの描画処理

#endif
