//=========================================================================================================================
//
// ゴール [goal.h]
// Author:Hiroya Katano
//
//=========================================================================================================================
#ifndef _GOAL_H_
#define _GOAL_H_
#include "main.h"

//=========================================================================================================================
// 構造体の定義
//=========================================================================================================================

// ゴールの構造体
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 move;		// 移動量
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bUse;				// 使用しているかどうか

} GOAL;

//=========================================================================================================================
// プロトタイプ宣言
//=========================================================================================================================
HRESULT InitGoal(void);	// ゴールの初期化処理
void UninitGoal(void);	// ゴールの終了処理
void UpdateGoal(void);	// ゴールの更新処理
void DrawGoal(void);	// ゴールの描画処理
GOAL *GetGoal(void);	// ゴールの情報取得
void SetGoal(D3DXVECTOR3 pos, D3DXVECTOR3 move, float fWigth, float fHeight);
void SetVertexGoal(void);

#endif