//===============================================================================================================
//
// メインヘッダー [main.h]
// Author:team 11
//
//===============================================================================================================
#ifndef _MAIN_H_
#define _MAIN_H_
#include <Windows.h>
#include "d3dx9.h"						// 描画処理に必要
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"						// 入力処理に必要
#include "xaudio2.h"					//サウンド再生に必要

//===============================================================================================================
// ライブラリのリンク
//===============================================================================================================
#pragma comment(lib, "d3d9.lib")	// 描画処理に必要
#pragma comment(lib, "d3dx9.lib")	// 拡張ライブラリ
#pragma comment(lib, "dxguid.lib")	// コンポーネント使用に必要
#pragma comment(lib, "dinput8.lib")	// 入力処理に必要
#pragma comment(lib, "winmm.lib")	// 
#pragma comment(lib, "xinput.lib")	// XInputの使用に必要

//===============================================================================================================
// マクロ定義
//===============================================================================================================
#define SCREEN_WIDTH_L	(0)			// スクリーンの幅 (左端)
#define SCREEN_WIDTH_R	(1280)		// スクリーンの幅 (右端)
#define SCREEN_HEIGHT_T	(0)			// スクリーンの高さ (上端)
#define SCREEN_HEIGHT_U	(720)		// スクリーンの高さ (下端)
#define FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)

#define VTX_NUM (4)
#define INT_ZERO (0)
#define Z_AXIS_ZERO (0.0f)

//===============================================================================================================
// 構造体の定義
//===============================================================================================================
// 頂点フォーマットに合わせた構造体
typedef struct
{
	D3DXVECTOR3 pos;	// 頂点処理
	float rhw;			// 1.0で固定
	D3DCOLOR col;		// 頂点カラー
	D3DXVECTOR2 tex;	// テクスチャの座標
} VERTEX_2D;

//===============================================================================================================
//列挙型
//===============================================================================================================
//モード
typedef enum
{
	MODE_TITLE = 0,	//タイトル画面
	MODE_TUTORIAL,	//チュートリアル画面
	MODE_GAME,		//ゲーム画面
	MODE_RESULT,	//リザルト画面
	MODE_MAX
} MODE;

//===============================================================================================================
// プロトタイプ宣言
//===============================================================================================================
LPDIRECT3DDEVICE9 GetDevice(void);
void SetMode(MODE mode);
MODE GetMode(void);

#endif