//=========================================================================================================================
//
// エフェクトヘッダー [effect.h]
// Author:Hiroya Katano
//
//=========================================================================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_
#include "main.h"


//=========================================================================================================================
// マクロ定義
//=========================================================================================================================
#define MAX_EFFECT (4096)
#define EFFECT_SIZE (50.0f)

#define EFFECT_COLOR_R (1.0f)														// 背景色(赤)
#define EFFECT_COLOR_G (0.50f)														// 背景色(緑)
#define EFFECT_COLOR_B (0.0f)														// 背景色(青)
#define EFFECT_COLOR_A (0.20f)														// 背景色(透明度)

//=========================================================================================================================
// プロトタイプ宣言
//=========================================================================================================================
HRESULT InitEffect(void);															// ポリゴンの初期化処理
void UninitEffect(void);															// ポリゴンの終了処理
void UpdateEffect(void);															// ポリゴンの更新処理
void DrawEffect(void);																// ポリゴンの描画処理
void SetEffect(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXCOLOR col, float fDecay, float fRadius, float fCntAlpha, int nLife);		// 

#endif
