//=========================================================================================================================
//
// アイテムヘッダー [item.h]
// Author:Hiroya Katano
//
//=========================================================================================================================
#ifndef _ITEM_H_
#define _ITEM_H_
#include "main.h"

//=========================================================================================================================
// マクロ定義
//=========================================================================================================================
#define MAX_ITEM (256)
#define MAX_TYPE_ITEM (4)
#define ITEM_COLOR_R (255)	// 背景色(赤)
#define ITEM_COLOR_G (255)	// 背景色(緑)
#define ITEM_COLOR_B (255)	// 背景色(青)
#define ITEM_COLOR_A (255)	// 背景色(透明度)
#define ITEM_SIZE_X (17)	
#define ITEM_SIZE_Y (17)

//=========================================================================================================================
// 構造体の定義
//=========================================================================================================================
//typedef enum
//{
//
//};

typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 move;	// 移動量
	int nType;			// 種類
	bool bUse;			// 使用しているかどうか
}ITEM;

//=========================================================================================================================
// プロトタイプ宣言
//=========================================================================================================================
HRESULT InitItem(void);															// ゲームの初期化処理
void UninitItem(void);															// ゲームの終了処理
void UpdateItem(void);															// ゲームの更新処理
void DrawItem(void);															// ゲームの描画処理
void SetItem(D3DXVECTOR3 pos, D3DXVECTOR3 move, int nType);
void SetVertexItem(int nIdx);
bool HitItem(int nIdx, int nType);

#endif