//=========================================================================================================================
//
// タイトルヘッダー [title.h]
// Author:Hiroya Katano
//
//=========================================================================================================================
#ifndef _TITLE_H_
#define _TIELE_H_
#include "main.h"

//=========================================================================================================================
// マクロ定義
//=========================================================================================================================
#define TITLE_NORMAL_COLOR (D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f))	// 背景色(赤, 緑, 青, 透明度)
#define TITLE_BG_SIZE_X (SCREEN_WIDTH)
#define TITLE_BG_SIZE_Y (SCREEN_HEIGHT)

#define TITLE_NAME_COLOR (D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f))	// タイトル名色(赤, 緑, 青, 透明度)
#define TITLE_NAME_VERTEX_SIZE_X (320)		// タイトル名の縦半径
#define TITLE_NAME_VERTEX_SIZE_Y (63)		// タイトル名の横半径

#define ENTER_SIGN_VERTEX_SIZE_X (233)		// エンターサインの縦半径
#define ENTER_SIGN_VERTEX_SIZE_Y (32)		// エンターサインの横半径

#define MOVE_TITLE_BG_U (0.00017f)
#define MOVE_TITLE_BG_V (0.00075f)

//=========================================================================================================================
// 構造体
//=========================================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;			// 位置
	D3DXVECTOR3 move;			// 移動量
} TITLE;

typedef enum
{
	TEX_TITLE_LABEL_BG = 0,		// タイトル背景
	TEX_TITLE_LABEL_NAME,		// タイトル名
	TEX_TITLE_LABEL_ENTER,		// エンターサイン
	TEX_TITLE_LABEL_MAX,
} TEX_TITLE_LABEL;

//=========================================================================================================================
// プロトタイプ宣言
//=========================================================================================================================
HRESULT InitTitle(void);															// ゲームの初期化処理
void UninitTitle(void);															// ゲームの終了処理
void UpdateTitle(void);															// ゲームの更新処理
void DrawTitle(void);															// ゲームの描画処理

#endif